Revit 2027 API
IFCFile.Read Method
Overload List
Name | Description
Read(IFCFileReadOptions) |  Reads content from a file of IFC format.
Read(IFCFileReadOptions, Int32, Int32) |  Reads content from a file of IFC format.
Top
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace